# specify a directory to install
cask_args appdir: '/Applications'

# install packages
tap 'caskroom/homebrew-cask' || true
tap 'neovim/neovim' || true
# tap 'caskroom/versions'
tap 'getantibody/tap'
# tap 'caskroom/fonts'
tap 'heroku/brew'

brew 'ack'
brew 'ag'
brew 'antibody'
brew 'asdf'
brew 'awscli'
brew 'cmake'
brew 'diff-so-fancy'
brew 'ffmpeg'
brew 'fzf'
brew 'git'
brew 'gpg'
brew 'heroku'
brew 'imagemagick'
brew 'jq'
brew 'jsonlint'
# brew 'mysql'
brew 'ncdu'
brew 'neovim'
brew 'node'
brew 'postgres'
# brew 'pow'
# brew 'redis'
brew 'selecta'
brew 'tig'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'vim'
brew 'wp-cli'
brew 'wget'
brew 'youtube-dl'

tap 'mas-cli/tap'
# tap-pin 'mas-cli/tap'
brew 'mas'

# Casks
cask '1password'
cask '1password-cli'
cask 'aerial'
cask 'alfred'
cask 'atom'
cask 'charles'
cask 'dash'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'insomnia'
cask 'istat-menus'
cask 'iterm2'
cask 'kaleidoscope'
cask 'karabiner-elements'
cask 'ngrok'
cask 'postico'
cask 'postman'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'spectacle'
cask 'tower'
cask 'transmit'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'zoomus'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Xcode', id: 497799835
mas 'Amphetamine', id: 937984704
mas 'Soulver', id: 413965349
mas 'DaisyDisk', id: 411643860

